garyPenhook/PIC-Assembler/edc/PIC18F27Q43.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnAIRQ" edc:desc="DMA abort trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnAIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AIRQ" edc:mask="0xff" edc:name="AIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AIRQ0" edc:mask="0x1" edc:name="AIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ1" edc:mask="0x1" edc:name="AIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ2" edc:mask="0x1" edc:name="AIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ3" edc:mask="0x1" edc:name="AIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ4" edc:mask="0x1" edc:name="AIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ5" edc:mask="0x1" edc:name="AIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ6" edc:mask="0x1" edc:name="AIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ7" edc:mask="0x1" edc:name="AIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSIRQ" edc:desc="DMA start trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIRQ" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SIRQ0" edc:mask="0x1" edc:name="SIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ1" edc:mask="0x1" edc:name="SIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ2" edc:mask="0x1" edc:name="SIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ3" edc:mask="0x1" edc:name="SIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ4" edc:mask="0x1" edc:name="SIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ5" edc:mask="0x1" edc:name="SIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ6" edc:mask="0x1" edc:name="SIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ7" edc:mask="0x1" edc:name="SIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x1" edc:beginaddr="0x0100" edc:endaddr="0x0200" edc:regionid="sfr1"/>
      <edc:SFRDataSector edc:bank="0x2" edc:beginaddr="0x0200" edc:endaddr="0x0300" edc:regionid="sfr2">
        <edc:SFRDef edc:access="-------n" edc:cname="PPSLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PPSLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0x200">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PPSLOCKED" edc:mask="0x1" edc:name="PPSLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RA0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RA0PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x201">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0PPS0" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS1" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS2" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS3" edc:mask="0x1" edc:name="RA0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS4" edc:mask="0x1" edc:name="RA0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS5" edc:mask="0x1" edc:name="RA0PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA0PPS6" edc:mask="0x1" edc:name="RA0PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RA1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RA1PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x202">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA1PPS0" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS1" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS2" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS3" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS4" edc:mask="0x1" edc:name="RA1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS5" edc:mask="0x1" edc:name="RA1PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1PPS6" edc:mask="0x1" edc:name="RA1PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RA2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RA2PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x203">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA2PPS0" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS1" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS2" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS3" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS4" edc:mask="0x1" edc:name="RA2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS5" edc:mask="0x1" edc:name="RA2PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2PPS6" edc:mask="0x1" edc:name="RA2PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RA3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RA3PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x204">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA3PPS0" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS1" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS2" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS3" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS4" edc:mask="0x1" edc:name="RA3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS5" edc:mask="0x1" edc:name="RA3PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3PPS6" edc:mask="0x1" edc:name="RA3PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RA4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RA4PPS" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x205">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA4PPS0" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS1" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS2" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS3" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS4" edc:mask="0x1" edc:name="RA4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS5" edc:mask="0x1" edc:name="RA4PPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4PPS6" edc:mask="0x1" edc:name="RA4PPS6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
