garyPenhook/PIC-Assembler/edc/PIC18F27Q43.PIC
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x28A"/>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I2C1RXB" edc:desc="I2C RECEIVE BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x28B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="I2C1TXB" edc:desc="I2C TRANSMIT BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x28C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNT" edc:desc="I2C COUNT REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNT" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x28D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CNT0" edc:mask="0x1" edc:name="CNT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT1" edc:mask="0x1" edc:name="CNT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT2" edc:mask="0x1" edc:name="CNT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT3" edc:mask="0x1" edc:name="CNT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT4" edc:mask="0x1" edc:name="CNT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT5" edc:mask="0x1" edc:name="CNT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT6" edc:mask="0x1" edc:name="CNT6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT7" edc:mask="0x1" edc:name="CNT7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB0" edc:desc="I2C ADDRESS BUFFER  REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x28E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB1" edc:desc="I2C ADDRESS BUFFER  REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x28F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR0" edc:desc="I2C ADDRESS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR0" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x290">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR1" edc:desc="I2C ADDRESS REGISTER 1" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="I2C1ADR1" edc:nzwidth="8" edc:por="11111110" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x291">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR2" edc:desc="I2C ADDRESS REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR2" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x292">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR3" edc:desc="I2C ADDRESS REGISTER 3" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="I2C1ADR3" edc:nzwidth="8" edc:por="11111110" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x293">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnscrnnn" edc:cname="I2C1CON0" edc:desc="I2C CONTROL REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x294">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x7" edc:name="MODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="MDR" edc:mask="0x1" edc:name="MDR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSTR" edc:mask="0x1" edc:name="CSTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEN" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="I2CEN" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnr-nnn" edc:cname="I2C1CON1" edc:desc="I2C CONTROL REGISTER 1" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x295">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSD" edc:mask="0x1" edc:name="CSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXU" edc:mask="0x1" edc:name="TXU" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXO" edc:mask="0x1" edc:name="RXO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT" edc:mask="0x1" edc:name="ACKT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKDT" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKCNT" edc:mask="0x1" edc:name="ACKCNT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CON2" edc:desc="I2C CONTROL REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1CON2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x296">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BFRET" edc:mask="0x3" edc:name="BFRET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SDAHT" edc:mask="0x3" edc:name="SDAHT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ABD" edc:mask="0x1" edc:name="ABD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FME" edc:mask="0x1" edc:name="FME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GCEN" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACNT" edc:mask="0x1" edc:name="ACNT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BFRET0" edc:mask="0x1" edc:name="BFRET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BFRET1" edc:mask="0x1" edc:name="BFRET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDAHT0" edc:mask="0x1" edc:name="SDAHT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDAHT1" edc:mask="0x1" edc:name="SDAHT1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="I2C1ERR" edc:desc="I2C ERROR REGISTER" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1ERR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x297">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NACKIE" edc:mask="0x1" edc:name="NACKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCLIE" edc:mask="0x1" edc:name="BCLIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIE" edc:mask="0x1" edc:name="BTOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NACKIF" edc:mask="0x1" edc:name="NACKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCLIF" edc:mask="0x1" edc:name="BCLIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTOIF" edc:mask="0x1" edc:name="BTOIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NACK1IE" edc:mask="0x1" edc:name="NACK1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCL1IE" edc:mask="0x1" edc:name="BCL1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO1IE" edc:mask="0x1" edc:name="BTO1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NACK1IF" edc:mask="0x1" edc:name="NACK1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCL1IF" edc:mask="0x1" edc:name="BCL1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BTO1IF" edc:mask="0x1" edc:name="BTO1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrr---" edc:cname="I2C1STAT0" edc:desc="I2C STATUS REGISTER 0" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1STAT0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x298">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="D" edc:desc="Data/Address bit" edc:mask="0x1" edc:name="D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R" edc:desc="Read/Write Information bit" edc:mask="0x1" edc:name="R" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MMA" edc:mask="0x1" edc:name="MMA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMA" edc:mask="0x1" edc:name="SMA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BFRE" edc:mask="0x1" edc:name="BFRE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="DATA" edc:mask="0x1" edc:name="DATA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="READ" edc:mask="0x1" edc:name="READ" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_ADDRESS" edc:mask="0x1" edc:name="NOT_ADDRESS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_WRITE" edc:mask="0x1" edc:name="NOT_WRITE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_A" edc:mask="0x1" edc:name="NOT_A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_W" edc:mask="0x1" edc:name="NOT_W" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-r-ns-r" edc:cname="I2C1STAT1" edc:desc="I2C STATUS REGISTER 1" edc:impl="0xad" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00100000" edc:name="I2C1STAT1" edc:nzwidth="8" edc:por="00100000" edc:_modsrc="DOS-03057_i2c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x299">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRBF" edc:mask="0x1" edc:name="CLRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRE" edc:mask="0x1" edc:name="RXRE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWE" edc:mask="0x1" edc:name="TXWE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
