garyPenhook/PIC-Assembler/edc/PIC18F27Q43.PIC
        <edc:SFRDef edc:access="nnnn---n" edc:cname="IPR2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000---0" edc:name="IPR2" edc:nzwidth="8" edc:por="0000---0" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x364">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTIP" edc:mask="0x1" edc:name="ADTIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIP" edc:mask="0x1" edc:name="DMA1SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIP" edc:mask="0x1" edc:name="DMA1DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIP" edc:mask="0x1" edc:name="DMA1ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIP" edc:mask="0x1" edc:name="DMA1AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x365">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:mask="0x1" edc:name="SPI1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:mask="0x1" edc:name="SPI1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IP" edc:mask="0x1" edc:name="SPI1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IP" edc:mask="0x1" edc:name="TMR2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IP" edc:mask="0x1" edc:name="TMR1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIP" edc:mask="0x1" edc:name="TMR1GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IP" edc:mask="0x1" edc:name="TMR0IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="IPR4" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="IPR4" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x366">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIP" edc:mask="0x1" edc:name="U1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIP" edc:mask="0x1" edc:name="U1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIP" edc:mask="0x1" edc:name="U1EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IP" edc:mask="0x1" edc:name="U1IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM1PIP" edc:mask="0x1" edc:name="PWM1PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IP" edc:mask="0x1" edc:name="PWM1IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="IPR5" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="IPR5" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x367">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:mask="0x1" edc:name="SPI2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:mask="0x1" edc:name="SPI2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2IP" edc:mask="0x1" edc:name="SPI2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR3IP" edc:mask="0x1" edc:name="TMR3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIP" edc:mask="0x1" edc:name="TMR3GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIP" edc:mask="0x1" edc:name="PWM2PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP" edc:mask="0x1" edc:name="PWM2IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x368">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IP" edc:mask="0x1" edc:name="INT1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IP" edc:mask="0x1" edc:name="CLC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IP" edc:mask="0x1" edc:name="CWG1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IP" edc:mask="0x1" edc:name="NCO1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIP" edc:mask="0x1" edc:name="DMA2SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIP" edc:mask="0x1" edc:name="DMA2DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIP" edc:mask="0x1" edc:name="DMA2ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIP" edc:mask="0x1" edc:name="DMA2AIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="IPR7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="IPR7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x369">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIP" edc:mask="0x1" edc:name="I2C1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIP" edc:mask="0x1" edc:name="I2C1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IP" edc:mask="0x1" edc:name="I2C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIP" edc:mask="0x1" edc:name="I2C1EIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IP" edc:mask="0x1" edc:name="CLC3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIP" edc:mask="0x1" edc:name="PWM3PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IP" edc:mask="0x1" edc:name="PWM3IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu000" edc:name="IPR8" edc:nzwidth="8" edc:por="xxxxx000" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x36A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIP" edc:mask="0x1" edc:name="U2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIP" edc:mask="0x1" edc:name="U2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIP" edc:mask="0x1" edc:name="U2EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IP" edc:mask="0x1" edc:name="U2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IP" edc:mask="0x1" edc:name="TMR5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIP" edc:mask="0x1" edc:name="TMR5GIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIP" edc:mask="0x1" edc:name="SCANIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n-nnnn" edc:cname="IPR9" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u-uuuu" edc:name="IPR9" edc:nzwidth="8" edc:por="--x-xxxx" edc:_modsrc="DOS-xxxx_Interrupts_Q43_PIE_IPR_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x36B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U3RXIP" edc:mask="0x1" edc:name="U3RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIP" edc:mask="0x1" edc:name="U3TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3EIP" edc:mask="0x1" edc:name="U3EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3IP" edc:mask="0x1" edc:name="U3IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IP" edc:mask="0x1" edc:name="CLC4IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
