garyPenhook/PIC-Assembler/edc/PIC18F27Q43.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="CWG2AS1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="CWG2AS1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3CC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CWG2STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CWG2STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3CD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRA" edc:desc="" edc:mask="0x1" edc:name="OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRB" edc:desc="" edc:mask="0x1" edc:name="OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRC" edc:desc="" edc:mask="0x1" edc:name="OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRD" edc:desc="" edc:mask="0x1" edc:name="OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG2STRA" edc:desc="" edc:mask="0x1" edc:name="CWG2STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2STRB" edc:desc="" edc:mask="0x1" edc:name="CWG2STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2STRC" edc:desc="" edc:mask="0x1" edc:name="CWG2STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2STRD" edc:desc="" edc:mask="0x1" edc:name="CWG2STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2OVRA" edc:desc="" edc:mask="0x1" edc:name="CWG2OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2OVRB" edc:desc="" edc:mask="0x1" edc:name="CWG2OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2OVRC" edc:desc="" edc:mask="0x1" edc:name="CWG2OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG2OVRD" edc:desc="" edc:mask="0x1" edc:name="CWG2OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="CWG3CLK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="CWG3CLK" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3CE">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG3CLKCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG3CS" edc:mask="0x1" edc:name="CWG3CS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG3ISM" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="CWG3ISM" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3CF">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG3DAT"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ISM" edc:mask="0x1f" edc:name="ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG3ISM" edc:mask="0x1f" edc:name="CWG3ISM" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISM0" edc:mask="0x1" edc:name="ISM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM1" edc:mask="0x1" edc:name="ISM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM2" edc:mask="0x1" edc:name="ISM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM3" edc:mask="0x1" edc:name="ISM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISM4" edc:mask="0x1" edc:name="ISM4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG3DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG3DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG3DBR" edc:mask="0x3f" edc:name="CWG3DBR" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG3DBR0" edc:mask="0x1" edc:name="CWG3DBR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBR1" edc:mask="0x1" edc:name="CWG3DBR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBR2" edc:mask="0x1" edc:name="CWG3DBR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBR3" edc:mask="0x1" edc:name="CWG3DBR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBR4" edc:mask="0x1" edc:name="CWG3DBR4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBR5" edc:desc="" edc:mask="0x1" edc:name="CWG3DBR5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG3DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="CWG3DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF" edc:desc="" edc:mask="0x3f" edc:name="DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG3DBF" edc:desc="" edc:mask="0x3f" edc:name="CWG3DBF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG3DBF0" edc:mask="0x1" edc:name="CWG3DBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBF1" edc:mask="0x1" edc:name="CWG3DBF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBF2" edc:mask="0x1" edc:name="CWG3DBF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBF3" edc:mask="0x1" edc:name="CWG3DBF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBF4" edc:mask="0x1" edc:name="CWG3DBF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3DBF5" edc:mask="0x1" edc:name="CWG3DBF5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---nnn" edc:cname="CWG3CON0" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="CWG3CON0" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3EN" edc:mask="0x1" edc:name="G3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG3MODE" edc:mask="0x7" edc:name="CWG3MODE" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CWG3LD" edc:mask="0x1" edc:name="CWG3LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3EN" edc:mask="0x1" edc:name="CWG3EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG3MODE0" edc:mask="0x1" edc:name="CWG3MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3MODE1" edc:mask="0x1" edc:name="CWG3MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3MODE2" edc:mask="0x1" edc:name="CWG3MODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--r-nnnn" edc:cname="CWG3CON1" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--x-0000" edc:name="CWG3CON1" edc:nzwidth="0x8" edc:por="--x-0000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IN" edc:desc="" edc:mask="0x1" edc:name="IN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG3POLA" edc:mask="0x1" edc:name="CWG3POLA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3POLB" edc:mask="0x1" edc:name="CWG3POLB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3POLC" edc:mask="0x1" edc:name="CWG3POLC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3POLD" edc:desc="" edc:mask="0x1" edc:name="CWG3POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3IN" edc:mask="0x1" edc:name="CWG3IN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="CWG3AS0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000101--" edc:name="CWG3AS0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="LSAC" edc:desc="" edc:mask="0x3" edc:name="LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LSDBD" edc:desc="" edc:mask="0x3" edc:name="LSDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="REN" edc:desc="" edc:mask="0x1" edc:name="REN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHUTDOWN" edc:desc="" edc:mask="0x1" edc:name="SHUTDOWN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LSAC0" edc:desc="" edc:mask="0x1" edc:name="LSAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSCA1" edc:desc="" edc:mask="0x1" edc:name="LSCA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB0" edc:desc="" edc:mask="0x1" edc:name="LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSDB1" edc:desc="" edc:mask="0x1" edc:name="LSDB1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CWG3LSAC0" edc:mask="0x1" edc:name="CWG3LSAC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3LSAC1" edc:mask="0x1" edc:name="CWG3LSAC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG3LSDB0" edc:mask="0x1" edc:name="CWG3LSDB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3LSDB1" edc:mask="0x1" edc:name="CWG3LSDB1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CWG3LSAC" edc:mask="0x3" edc:name="CWG3LSAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CWG3LSDB" edc:mask="0x3" edc:name="CWG3LSDB" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="LSBD" edc:desc="" edc:mask="0x3" edc:name="LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LSAC1" edc:desc="" edc:mask="0x1" edc:name="LSAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD0" edc:desc="" edc:mask="0x1" edc:name="LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LSBD1" edc:desc="" edc:mask="0x1" edc:name="LSBD1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG3LSBD0" edc:mask="0x1" edc:name="CWG3LSBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3LSBD1" edc:mask="0x1" edc:name="CWG3LSBD1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CWG3LSBD" edc:mask="0x3" edc:name="CWG3LSBD" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="CWG3AS1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="CWG3AS1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CWG3STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CWG3STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3D6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRA" edc:desc="" edc:mask="0x1" edc:name="OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRB" edc:desc="" edc:mask="0x1" edc:name="OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRC" edc:desc="" edc:mask="0x1" edc:name="OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRD" edc:desc="" edc:mask="0x1" edc:name="OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG3STRA" edc:desc="" edc:mask="0x1" edc:name="CWG3STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3STRB" edc:desc="" edc:mask="0x1" edc:name="CWG3STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3STRC" edc:desc="" edc:mask="0x1" edc:name="CWG3STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3STRD" edc:desc="" edc:mask="0x1" edc:name="CWG3STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3OVRA" edc:desc="" edc:mask="0x1" edc:name="CWG3OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3OVRB" edc:desc="" edc:mask="0x1" edc:name="CWG3OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3OVRC" edc:desc="" edc:mask="0x1" edc:name="CWG3OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG3OVRD" edc:desc="" edc:mask="0x1" edc:name="CWG3OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
